app/controllers/posts_controller.rb

INSERT INTO "posts" ("message", "created_at", "updated_at", "users_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["message", "Woo!"], ["created_at", "2020-06-05 09:41:16.209167"], ["updated_at", "2020-06-05 09:41:16.209167"], ["users_id", 1]]
---
  def create
    @post = Post.create(post_params)

SELECT  "posts".* FROM "posts" ORDER BY "posts"."id" DESC LIMIT $1  [["LIMIT", 5]]
---
  def index
    @posts = Post.last(5).reverse